# Taps
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'nicoverbruggen/homebrew-cask'
tap 'jesseduffield/lazygit'

#CLI
brew 'gnupg'
brew 'lazygit'
brew 'neofetch'
brew 'direnv'
brew 'ranger'
brew 'duf'
brew 'bat'
brew 'git-delta'
brew 'exa'
brew 'fzf'
brew 'fzy'
brew 'fd'
brew 'hey' # Like a ab (ApacheBench)


#BROWSERS
cask 'chromium'
cask 'brave-browser-nightly'
cask 'opera-gx'
cask 'google-chrome-canary'
cask 'vivaldi-snapshot'
cask 'firefox-nightly'
cask 'opera-developer'


# Fonts
# cask 'font-cascadia-mono'
# cask 'font-caskaydia-cove-nerd-font'
# cask 'font-fira-code'
# cask 'font-fira-code-nerd-font'
# cask 'font-hack-nerd-font'
# cask 'font-iosevka'
# cask 'font-iosevka-slab'
# cask 'font-iosevka-nerd-font'
# cask 'font-jetbrains-mono'
# cask 'font-jetbrains-mono-nerd-font'
# cask 'font-victor-mono'
# cask 'font-victor-mono-nerd-font'


# Apps
brew 'mas' # Mac App Store manager
cask 'authy'
cask 'bitwarden'
cask 'macs-fan-control'
cask 'spotify'

# Mac App Store
mas "Battery Health", id: 490192174
mas "ColorSlurp", id: 1287239339
mas "Memory Diag", id: 748212890
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835