# Taps
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'nicoverbruggen/homebrew-cask'
tap 'jesseduffield/lazygit'
tap 'ferdium/ferdium'

#CLI
brew 'gnupg'
brew 'lazygit'
brew 'neofetch'
brew 'direnv'
brew 'ranger'
brew 'duf'
brew 'bat'
brew 'git-delta'
brew 'exa'
brew 'hey' # Like a ab (ApacheBench)


#BROWSERS
cask 'chromium'
cask 'brave-browser-nightly'
cask 'opera-gx'
cask 'google-chrome-canary'
cask 'vivaldi-snapshot'
cask 'firefox-nightly'
cask 'opera-developer'

# Apps
brew 'mas' # Mac App Store manager
cask 'authy'
cask 'bitwarden'
cask 'macs-fan-control'
cask 'spotify'
cask 'ferdium-nightly'
cask 'appcleaner'
cask 'microsoft-teams'
cask 'notion'
cask 'dbeaver-community'
cask 'jetbrains-toolbox'
cask 'transmission'
cask 'vlc'
cask 'stack-stack'
cask 'keepingyouawake'
cask 'appcleaner'
#cask 'figma'
#cask 'rectangle'
#cask 'slack-beta'
cask 'zoom'
#cask 'miro'

# Mac App Store
mas "Battery Health", id: 490192174
mas "ColorSlurp", id: 1287239339
mas "Memory Diag", id: 748212890
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
