# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'homebrew/core'
tap 'jesseduffield/lazydocker'


#Terminal
brew 'zsh'
brew 'python'
brew 'python3'
brew 'pyenv'
brew 'neovim'
brew 'fzf'
brew 'fzy'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'bat'
brew 'fd'
brew 'direnv'
brew 'exa'
brew 'git-delta'
brew 'lazydocker'
brew 'lazygit'
brew 'glow'
brew 'gh'
brew 'tree'
cask 'google-cloud-sdk'
brew 'neofetch'
brew 'zsh-completion'
brew 'ranger'
brew 'reattach-to-user-namespace'
brew 'wakatime-cli'
brew 'tmux'
brew 'semgrep'
cask 'forticlient'

# Apps
brew 'mas' # Mac App Store manager
cask 'authy'
cask 'bitwarden'
cask 'brave-browser'
cask 'firefox'
cask 'kap'
cask 'macs-fan-control'
cask 'notion'
cask 'opera-gx'
cask 'rectangle'
cask 'skype'
cask 'slack'
cask 'stack-stack'
cask 'spotify'
cask 'telegram-desktop'
cask 'toggl-track'
cask 'transmission'
cask 'vivaldi'
cask 'vlc'
cask 'whatsapp'
cask 'iterm2'
cask 'keepingyouawake'
cask 'whatsapp'
cask 'zoom'
cask 'kitty'
cask 'appcleaner'
cask 'microsoft-teams'
cask 'visual-studio-code'
cask 'onedrive'
cask 'microsoft-outlook'

# Fonts
cask 'font-cascadia-mono'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-iosevka'
cask 'font-iosevka-slab'
cask 'font-iosevka-nerd-font'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'


# Development
cask 'docker'
brew 'fastlane'
cask 'figma'
cask 'firebase-admin'
brew 'firebase-cli'
cask 'flipper'
cask 'cyberduck'
cask 'figma'
cask 'firefox-developer-edition'
cask 'google-chrome-canary'
cask 'genymotion'
cask 'github'
brew 'gh'
cask 'ngrok'
#cask 'now'
cask 'sublime-text'
#brew 'yarn', args: ['without-node']
brew 'carthage'
cask 'android-sdk'
cask 'intel-haxm'
cask 'android-file-transfer'
brew 'scrcpy'
cask 'android-studio'
brew 'rbenv'
brew 'watchman'
cask 'visual-studio-code'
cask 'altair-graphql-client'
cask 'runjs'

# Mac App Store
mas "Battery Health", id: 490192174
mas "ColorSlurp", id: 1287239339
mas "Memory Diag", id: 748212890
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
