# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'homebrew/core'
tap 'jesseduffield/lazydocker/lazydocker'


#Terminal
brew 'zsh'
brew 'fzf'
brew 'fzy'
brew 'fd'
brew 'bat'
brew 'direnv'
brew 'exa'
brew 'git-delta'
brew 'lazydocker'
brew 'lazygit'
brew 'glow'
brew 'gh'
brew 'tree'
cask 'google-cloud-sdk'
brew 'stow'

# Apps
brew 'mas' # Mac App Store manager
cask 'authy'
cask 'bitwarden'
cask 'brave-browser'
cask 'firefox'
cask 'kap'
cask 'macs-fan-control'
cask 'notion'
cask 'opera-developer'
cask 'rectangle'
cask 'skype'
cask 'slack'
cask 'stack-stack'
cask 'spotify'
cask 'telegram-desktop'
cask 'toggl-track'
cask 'transmission'
cask 'vivaldi'
cask 'vlc'
cask 'whatsapp'
cask 'iterm2'
cask 'keepingyouawake'
cask 'whatsapp'
cask 'zoom'


# Fonts
cask 'font-cascadia-mono' 
cask 'font-caskaydia-cove-nerd-font'
cask 'font-fira-code' 
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-iosevka'
cask 'font-iosevka-slab'
cask 'font-iosevka-nerd-font'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'


# Mac App Store
mas "Battery Health", id: 490192174
mas "ColorSlurp", id: 1287239339
mas "Memory Diag", id: 748212890
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835

# Development
cask 'docker'
brew 'fastlane'
cask 'figma'
cask 'firebase-admin'
brew 'firebase-cli'
cask 'flipper'
cask 'cyberduck'
cask 'figma'
cask 'firefox-developer-edition'
cask 'genymotion'
cask 'github'
brew 'gh'
cask 'ngrok'
cask 'now'
cask 'sublime-text'
brew 'yarn', args: ['without-node']